; domain
(define (domain caveDomain)

    (:requirements :strips)
    
    (:predicates
    (location ?x) (person ?x) (treasure ?x) (shoes ?x) (weapon ?x)
    (monster ?x) (pit ?x)
    (at-person ?person1 ?location1) (at-treasure ?treasure1 ?location1)
    (at-shoes ?shoes1 ?location1) (at-weapon ?weapon1 ?location1) 
    (at-monster ?monster1 ?location1) (at-pit ?pit1 ?location1)
    (hasPath ?location1 ?location2) (isSafe ?location1)
    (carries ?person1 ?treasure1) (holds ?person1 ?weapon1) 
    (wears ?person1 ?shoes1)
    )

    (:action Walk
    :parameters ( ?P ?L1 ?L2 )
    :precondition (and (person ?P) (location ?L1) (location ?L2) 
    (at-person ?P ?L1) (hasPath ?L1 ?L2) (isSafe ?L2)
    )
    :effect (and (at-person ?P ?L2) (not (at-person ?P ?L1)))
    )
    
    (:action PickTreasure
    :parameters ( ?P ?L ?T)
    :precondition (and (person ?P) (location ?L) (treasure ?T)
    (at-person ?P ?L) (at-treasure ?T ?L))
    :effect (and (carries ?P ?T) (not (at-treasure ?T ?L)))
    )
    
    (:action PickWeapon
    :parameters ( ?P ?L ?W)
    :precondition (and (person ?P) (location ?L) (weapon ?W)
    (at-person ?P ?L) (at-weapon ?W ?L))
    :effect (and (holds ?P ?W) (not (at-weapon ?W ?L)))
    )
    
    (:action PickShoes
    :parameters ( ?P ?L ?S)
    :precondition (and (person ?P) (location ?L) (shoes ?S)
    (at-person ?P ?L) (at-shoes ?S ?L))
    :effect (and (wears ?P ?S) (not (at-shoes ?S ?L)))
    )
    
    (:action UseWeapon
    :parameters ( ?P ?L1 ?L2 ?M ?W)
    :precondition (and (person ?P) (location ?L1) (location ?L2) (monster ?M)
    (weapon ?W) (at-person ?P ?L1) (holds ?P ?W) 
    (hasPath ?L1 ?L2) (at-monster ?M ?L2))
    :effect (and (isSafe ?L2) (not (holds ?P ?W)) (not (at-monster ?M ?L2)))
    )
    
    (:action Fly
    :parameters ( ?P ?L1 ?L2 ?PIT ?S)
    :precondition (and (person ?P) (location ?L1) (location ?L2) (pit ?PIT)
    (shoes ?S) (at-person ?P ?L1) (wears ?P ?S) (hasPath ?L1 ?L2) 
    (at-pit ?PIT ?L2))
    :effect (and (at-person ?P ?L2) (not (at-person ?P ?L1)) (not (wears ?P ?S)))
    )
    
)

; problem
(define (problem Monster1)

    (:domain caveDomain)
    
    (:objects person1 loc1 loc2 loc3 loc4 loc5 loc6 monster1 pit1 treasure1 )
    
    (:init
    (person person1) (location loc1) (location loc2) (location loc3)
    (location loc4) (location loc5) (location loc6) (treasure treasure1)
    (monster monster1) (pit pit1) (at-person person1 loc1)
    (at-monster monster1 loc6) (at-pit pit1 loc5) (at-treasure treasure1 loc4)
    (isSafe loc1) (isSafe loc2) (isSafe loc3) (isSafe loc4)
    (hasPath loc1 loc5) (hasPath loc1 loc6) (hasPath loc1 loc2)
    (hasPath loc2 loc1) (hasPath loc2 loc3) (hasPath loc3 loc2)
    (hasPath loc3 loc4) (hasPath loc4 loc3) (hasPath loc5 loc4)
    (hasPath loc6 loc4) 
    )
    
    (:goal (and (at-person person1 loc1) (carries person1 treasure1)))
)

; plan
1. (walk person1 loc1 loc2)
   deleted: (at-person person1 loc1)
   added: (at-person person1 loc2)
   goals met: 0 of 2
2. (walk person1 loc2 loc3)
   deleted: (at-person person1 loc2)
   added: (at-person person1 loc3)
   goals met: 0 of 2
3. (walk person1 loc3 loc4)
   deleted: (at-person person1 loc3)
   added: (at-person person1 loc4)
   goals met: 0 of 2
4. (picktreasure person1 loc4 treasure1)
   deleted: (at-treasure treasure1 loc4)
   added: (carries person1 treasure1)
   goals met: 1 of 2
5. (walk person1 loc4 loc3)
   deleted: (at-person person1 loc4)
   added: (at-person person1 loc3)
   goals met: 1 of 2
6. (walk person1 loc3 loc2)
   deleted: (at-person person1 loc3)
   added: (at-person person1 loc2)
   goals met: 1 of 2
7. (walk person1 loc2 loc1)
   deleted: (at-person person1 loc2)
   added: (at-person person1 loc1)
   goals met: 2 of 2
